app/Http/Controllers/front/GlobalusersController.php

	public function getCmsPageDetails($pageSlug = "ansar"){
		$user_id = !empty(Auth::user())? Auth::user()->id:'';
		$lang = App::getLocale();
		if(empty($lang)){
			$lang = "en";
		}

		if(empty($pageSlug)){
			Session::flash('flash_notice',  trans("Pagination Error!"));
			return redirect()->back();
		}

		$cmsPageDetails = DB::table('cms_pages')->where('slug',$pageSlug)->where('is_deleted',0)->where('is_active',1)->first();
---
select * from `cms_pages` where `slug` = 'special-projects' and `is_deleted` = '0' and `is_active` = '1' limit 1


		}

		$sliderImages = DB::table('cms_images')->where('cms_id',$cmsPageDetails->id)->orderBy('id','DESC')->get();

		$orderedProjectIdArray	=	Project::where('project_module',$cmsPageDetails->project)->orderBy('order','ASC')->lists('id','id')->toArray();
---
select * from `cms_images` where `cms_id` = '2' order by `id` desc
select `id`, `id` from `projects` where `project_module` = '2' order by `order` asc


		if(!empty($allProjectLists)){
		  foreach($allProjectLists as &$allProjectList){
			$allOrderIds	=	DonationOrder::where('sub_project_id',$allProjectList->id)->where('is_deleted',0)->lists('id','id');
			$totalApprovedContribution	=	DonationPayment::whereIn('order_id',$allOrderIds)->where('payment_status',2)->where('is_deleted',0)->where('is_active',1)->sum('amount');
---
select `id`, `id` from `donation_orders` where `sub_project_id` = '133' and `is_deleted` = '0'
select sum(`amount`) as aggregate from `donation_payments` where `order_id` in ('7339', '7355', '7356', '7357', '7361', '7368', '7375', '7376', '7390', '7392', '7403', '7415', '7428', '7438', '7449', '7453', '7456', '7463', '7470', '7471', '7472', '7498', '7505', '7506', '7507', '7508', '7516', '7521', '7524', '7529', '7535', '7556', '7568', '7585', '7606', '7608', '7619', '7626', '7631', '7645', '7720', '7731', '7764', '7769', '7787', '7806', '7807', '7813', '7821', '7830', '7845', '7846', '7847', '7855', '7859', '7860', '7863', '7865', '7868', '7869', '7878', '7892', '7994', '7998', '8008', '8009', '8010', '8013', '8028', '8031', '8050', '8051', '8058', '8083', '8087', '8092', '8093', '8095', '8160', '8198', '8212', '8216', '8217', '8218', '8226', '8232', '8237', '8242', '8247', '8248', '8251', '8259', '8263', '8274', '8285', '8296', '8301', '8307', '8325', '8338', '8358', '8365', '8371', '8385', '8386', '8396', '8398', '8409', '8427', '8430', '8474', '8475', '8490', '8493', '8496', '8497', '8503', '8506') and `payment_status` = '2' and `is_deleted` = '0' and `is_active` = '1'