app/libraries/CustomHelper.php

select * from `project_modules` where `is_deleted` = '0' and `is_active` = '1' order by `created_at` asc
select * from `projects` where `project_module` = '1' and `is_deleted` = '0' order by `created_at` asc
select * from `sub_projects` where `project_id` = '26' and `project_module` = '1' and `is_deleted` = '0' order by `created_at` asc
---
	public static function getHeaderMenus(){
		$userId				=	!empty(Auth::user()) ? Auth::user()->id:'';

		$HeaderMenuArray = array();
		if(!empty(Auth::user()) && (Auth::user()->user_role_id == 1)){
			$projectModules = DB::table('project_modules')->where('is_deleted',0)->where('is_active',1)->orderBy('created_at','ASC')->get();
			if(!empty($projectModules)){
				foreach($projectModules as $projectModule){
					$activeMainAction = 0;
					$projects = DB::table('projects')->where('project_module',$projectModule->id)->where('is_deleted',0)->orderBy('created_at','ASC')->get();
					$active_sub_action = 0;
					if(!empty($projects)){
						foreach($projects as &$project){
							$activeAction = 0;
							$subProjects = DB::table('sub_projects')->where('project_id',$project->id)->where('project_module',$projectModule->id)->where('is_deleted',0)->orderBy('created_at','ASC')->get();

select `id`, `page_name`, `slug` from `cms_pages` where `is_deleted` = '0' and `is_active` = '1' order by `created_at` asc
---

			}
		}else{
			$cmsPages = DB::table('cms_pages')->where('is_deleted',0)->where('is_active',1)->select('id','page_name','slug')->orderBy('created_at','ASC')->get();

select `id`, `page_name`, `slug` from `cms_pages` where `is_deleted` = '0' and `is_active` = '1' and `project` = '1' limit 1
---
	public static function getHeaderHomeMenus(){
		$userId				=	!empty(Auth::user()) ? Auth::user()->id:'';

		$homePageButton	=	DB::table('cms_pages')->where('is_deleted',0)->where('is_active',1)->select('id','page_name','slug')->where('project',1)->first();